# encoding: UTF-8

typedefDict = {}

#########################################################################
###@author 中泰证券股份有限公司
###@file xtp_api_data_type.h
###@brief 定义兼容数据基本类型
#########################################################################
### 存放版本号的字符串长度
XTP_VERSION_LEN = 16
### 版本号类型
typedefDict["XTPVersionType"] = "string"
### 可交易日字符串长度
XTP_TRADING_DAY_LEN = 9
### 存放证券代码的字符串长度
XTP_TICKER_LEN = 16
### 存放证券名称的字符串长度
XTP_TICKER_NAME_LEN = 64
### 本地报单编号的字符串长度
XTP_LOCAL_ORDER_LEN = 11
### 交易所单号的字符串长度
XTP_ORDER_EXCH_LEN = 17
### 成交执行编号的字符串长度
XTP_EXEC_ID_LEN = 18
### 交易所交易员代码字符串长度
XTP_BRANCH_PBU_LEN = 7
### 用户资金账户的字符串长度
XTP_ACCOUNT_NAME_LEN = 16
#########################################################################
###@brief XTP_LOG_LEVEL是日志输出级别类型
#########################################################################
typedefDict["XTP_LOG_LEVEL"] = "enum"
#########################################################################
###@brief XTP_PROTOCOL_TYPE是通讯传输协议方式
#########################################################################
typedefDict["XTP_PROTOCOL_TYPE"] = "enum"
#########################################################################
###@brief XTP_EXCHANGE_TYPE是交易所类型
#########################################################################
typedefDict["XTP_EXCHANGE_TYPE"] = "enum"
##########################################################################
###@brief XTP_MARKET_TYPE市场类型
##########################################################################
typedefDict["XTP_MARKET_TYPE"] = "enum"
#########################################################################
###@brief XTP_PRICE_TYPE是价格类型
#########################################################################
typedefDict["XTP_PRICE_TYPE"] = "enum"
#########################################################################
###@brief XTP_SIDE_TYPE是买卖方向类型
#########################################################################
typedefDict["XTP_SIDE_TYPE"] = "int"
###买（新股申购，ETF买，配股，信用交易中担保品买）
XTP_SIDE_BUY = 1
###卖（逆回购，ETF卖，信用交易中担保品卖）
XTP_SIDE_SELL = 2
###申购
XTP_SIDE_PURCHASE = 7
###赎回
XTP_SIDE_REDEMPTION = 8
###拆分
XTP_SIDE_SPLIT = 9
###合并
XTP_SIDE_MERGE = 10
###改版之后的side的备兑，暂不支持
XTP_SIDE_COVER = 11
###改版之后的side锁定（对应开平标识为开）#解锁（对应开平标识为平）
XTP_SIDE_FREEZE = 12
### 融资买入
XTP_SIDE_MARGIN_TRADE = 21
### 融券卖出
XTP_SIDE_SHORT_SELL = 22
### 卖券还款
XTP_SIDE_REPAY_MARGIN = 23
### 买券还券
XTP_SIDE_REPAY_STOCK = 24
### 现金还款
XTP_SIDE_CASH_REPAY_MARGIN = 25
### 现券还券
XTP_SIDE_STOCK_REPAY_STOCK = 26
###未知或者无效买卖方向
XTP_SIDE_UNKNOWN = 27
#########################################################################
###@brief XTP_POSITION_EFFECT_TYPE是开平标识类型
#########################################################################
typedefDict["XTP_POSITION_EFFECT_TYPE"] = "int"
### 初始值或未知值开平标识，现货适用
XTP_POSITION_EFFECT_INIT = 0
### å¼€
XTP_POSITION_EFFECT_OPEN = 1
### å¹³
XTP_POSITION_EFFECT_CLOSE = 2
### 强平
XTP_POSITION_EFFECT_FORCECLOSE = 3
### 平今
XTP_POSITION_EFFECT_CLOSETODAY = 4
### 平昨
XTP_POSITION_EFFECT_CLOSEYESTERDAY = 5
### 强减
XTP_POSITION_EFFECT_FORCEOFF = 6
### 本地强平
XTP_POSITION_EFFECT_LOCALFORCECLOSE = 7
### 未知的开平标识类型
XTP_POSITION_EFFECT_UNKNOWN = 8
#########################################################################
###@brief XTP_ORDER_ACTION_STATUS_TYPE是报单操作状态类型
#########################################################################
typedefDict["XTP_ORDER_ACTION_STATUS_TYPE"] = "enum"
#########################################################################
###@brief XTP_ORDER_STATUS_TYPE是报单状态类型
#########################################################################
typedefDict["XTP_ORDER_STATUS_TYPE"] = "enum"
#########################################################################
###@brief XTP_ORDER_SUBMIT_STATUS_TYPE是报单提交状态类型
#########################################################################
typedefDict["XTP_ORDER_SUBMIT_STATUS_TYPE"] = "enum"
#########################################################################
###@brief XTP_TE_RESUME_TYPE是公有流（订单响应、成交回报）重传方式
#########################################################################
typedefDict["XTP_TE_RESUME_TYPE"] = "enum"
##########################################################################
###@brief ETF_REPLACE_TYPE现金替代标识定义
##########################################################################
typedefDict["ETF_REPLACE_TYPE"] = "enum"
##########################################################################
###@brief XTP_TICKER_TYPE证券类型
##########################################################################
typedefDict["XTP_TICKER_TYPE"] = "enum"
##########################################################################
###@brief XTP_BUSINESS_TYPE证券业务类型
##########################################################################
typedefDict["XTP_BUSINESS_TYPE"] = "enum"
##########################################################################
###@brief XTP_ACCOUNT_TYPE账户类型
##########################################################################
typedefDict["XTP_ACCOUNT_TYPE"] = "enum"
#########################################################################
###@brief XTP_FUND_TRANSFER_TYPE是资金流转方向类型
#########################################################################
typedefDict["XTP_FUND_TRANSFER_TYPE"] = "enum"
#########################################################################
###@brief XTP_FUND_OPER_STATUS柜台资金操作结果
#########################################################################
typedefDict["XTP_FUND_OPER_STATUS"] = "enum"
#########################################################################
###@brief XTP_SPLIT_MERGE_STATUS是一个基金当天拆分合并状态类型
#########################################################################
typedefDict["XTP_SPLIT_MERGE_STATUS"] = "enum"
#########################################################################
###@brief XTP_TBT_TYPE是一个逐笔回报类型
#########################################################################
typedefDict["XTP_TBT_TYPE"] = "enum"
#########################################################################
###@brief XTP_OPT_CALL_OR_PUT_TYPE是一个认沽或认购类型
#########################################################################
typedefDict["XTP_OPT_CALL_OR_PUT_TYPE"] = "enum"
#########################################################################
###@brief XTP_OPT_EXERCISE_TYPE_TYPE是一个行权方式类型
#########################################################################
typedefDict["XTP_OPT_EXERCISE_TYPE_TYPE"] = "enum"
#########################################################################
###@brief XTP_POSITION_DIRECTION_TYPE是一个持仓方向类型
#########################################################################
typedefDict["XTP_POSITION_DIRECTION_TYPE"] = "enum"
#########################################################################
###TXTPTradeTypeType是成交类型类型
#########################################################################
typedefDict["TXTPTradeTypeType"] = "char"
###普通成交
XTP_TRDT_COMMON = '0'
###现金替代
XTP_TRDT_CASH = '1'
###一级市场成交
XTP_TRDT_PRIMARY = '2'
#########################################################################
###TXTPOrderTypeType是报单类型类型
#########################################################################
typedefDict["TXTPOrderTypeType"] = "char"
###正常
XTP_ORDT_Normal = '0'
###报价衍生
XTP_ORDT_DeriveFromQuote = '1'
###组合衍生
XTP_ORDT_DeriveFromCombination = '2'
###组合报单
XTP_ORDT_Combination = '3'
###条件单
XTP_ORDT_ConditionalOrder = '4'
###互换单
XTP_ORDT_Swap = '5'
